<?php defined('SYSPATH') or die('No direct script access.');

return array(
    'name' => 'My Custom Module',
    'version' => '1.0.8',
    'version_code' => 10203,
    'author' => 'Artonit',
    'description' => 'Экспорт импорт контактов и организаций',
    'website' => 'http://artonit.ru',
    'license' => 'MIT',
    'dependencies' => array(
        'database' => '>=3.3.0'
    ),
	'abbr'=>'30.11.2025
Вер. 1.0.8
[+]
Добавлена проверка файла с целью выявить нарушения в форматах данных.
Если нарушения выявлены, то импорт не производится, указывается на ошибки, которые надо исправить.
[*]
При импорте данных из csv файла выполняется анализ первого поля. В строках, у которых первое поле одинаковы, карты присваиваются одному и тому же человеку.
',
	
);