<?php defined('SYSPATH') or die('No direct script access.');

return array(
    'name' => 'My Custom Module',
    'version' => '1.0.9',
    'version_code' => 10203,
    'author' => 'Artonit',
    'description' => 'Экспорт импорт контактов и организаций',
    'website' => 'http://artonit.ru',
    'license' => 'MIT',
    'dependencies' => array(
        'database' => '>=3.3.0'
    ),
	'abbr'=>'26.06.2026
		Вер. 1.0.9
		[+]
		Добавлена проверка файла с целью выявить нарушения в форматах данных.
		Если нарушения выявлены, то импорт не производится, указывается на ошибки, которые надо исправить.
		[*]
		При импорте данных из csv файла выполняется анализ первого поля. В строках, у которых первое поле одинаковы, карты присваиваются одному и тому же человеку.
		Модальная формы выводит название организации, куда будет происходить вставка данных
		',
	'csv_format'=>'Разделитель: точка с запятой (;)
			<br>Колонки (7 полей):
			<ol style="margin-top: 8px; margin-bottom: 5px; padding-left: 20px;">
					<li><strong>ID</strong> — число (уникальный идентификатор)</li>
					<li><strong>Фамилия</strong> — текст</li>
					<li><strong>Имя</strong> — текст</li>
					<li><strong>Отчество</strong> — текст</li>
					<li><strong>Примечание</strong> — текст (необязательное поле)</li>
					<li><strong>Номер карты</strong> — текст (идентификатор карты)</li>
					<li><strong>Тип карты</strong> — число (1-5)</li>
				</ol>
				<strong>Пример строки:</strong>
			<br>1;Иванов;Иван;Иванович;;1234567890;1
			<br>2;Петров;Петр;Петрович;Директор;ABCDEF1234;2',
);