<?php
return array(
		'count_event'=>'Количество записей',
		'ID_ORG'=>'ID организации',
		'ORG_NAME'=>'Название организации',
		'ORG_CHILD'=>'Количество нижестоящих организаций',
		'ORG_PEOPLE_COUNT'=>'Количество людей в организации',
		'ToDo'=>'Перенос данных без названия организации',
		'ToDo2'=>'Перенос организации с названием',
		'Export/import people'=>'Экспорт/импорт сотрудников.',
		'org_panel_title'=>'Операции с организациями',
		'orgName'=>'Название организации: ',
		'org_info_title_1'=>'Установка времен для расчета рабочего времени.',
		'id_str'=>'Строки для импорта',
		'about_eximport'=>'1. ExportPeope - будут экспортированы контакты, имеющие идентификатор. Название файла совпадает с названием организации, расширение csv.<br>
		2. import - контакты из выбранного файла будут вставлены в выбранную группу.<br>
		3.	exportTree – экспорт нижестоящий организаций, контактов и карт в файл с расширением json. Созданный файл скачивается браузером.<br>
4.	importTree – вставка организации, контактов и карт в выбранную организацию. При ошибке вставки карт выводится сообщение об ошибке. В лог-файле C:\xampp\htdocs\city\application\logs\<месяц>\<дата>.php выводится инормация: номер карты, который не удалось вставить, и кому эта карта принадлежит',
		'warning_tree_import'=>'ВНИМАНИЕ! При ошибке importTree необходимоу вручную удалить уже добавленные контакты и организации.',

);
